Repository: eubr-bigsea/juicer
Catalog: juicer/i18n/locales/*/LC_MESSAGES/messages.po
Languages: pt

source: Processing workflow queue %s
pt: Processando fila de workflow %s

source: Invalid platform value: {}
pt: Valor inválido para a plataforma: {}

source: At least one parameter is missing
pt: Parâmetro ausente na função de agregação

source: Method generate_code should be implemented in {} subclass
pt: Método generate_code pode ser implementado na subclasse {}

source: This implementation of traceability do not support multiple inputs
pt: Esta implementação de rastreabilidade não suporta entradas múltiplas

source: Workflow must have at least 1 data source to be deployed.
pt: Para ser implantado, o fluxo de trabalho precisa de pelo menos uma fonte de dados.

source: Parameter '{}' must be informed for task {}
pt: O parâmetro '{}' deve ser informado para a tarefa {}

source: Parameters '{}' must be informed for task {}
pt: Parâmetros '{}' devem ser informados para a tarefa {}

source: Parameters '{}' and '{}' must be informed for task {}
pt: Parâmetros '{}' e '{}' devem ser informado para a tarefa {}

source: Emit %s %s %s %s
pt: Emitir %s %s %s %s

source: Unhandled error (%s) >%s
pt: Erro não tratado (%s) >%s

source: Processing message %s for app %s
pt: Processando a mesangem %s para a aplicação %s

source: Running job with lang {}/{}
pt: Executando o job usando o idioma {}/{}

source: Execute message finished
pt: Mensagem de execução finalizada

source: Terminate message received (job_id=%s)
pt: Mensagem de término recebida (job_id=%s)

source: Terminate message received (app=%s)
pt: Mensagem de término recebida (app=%s)

source: Unknown message type %s
pt: Tipo da mensagem desconhecido %s

source: Running job
pt: Executando trabalho

source: Job finished in {0:.2f}s
pt: Job executado em {0:.2f}s

source: Invalid or missing parameters: {}
pt: Parâmetro inválido ou ausente: {}

source: Unhandled error
pt: Erro não tratado

source: Spark minion (workflow_id=%s,app_id=%s) started (pid=%s)
pt: Spark minion (workflow_id=%s, app_id=%s) iniciou (pid=%s)

source: Parameter '{}' and '{}' must be informed for task {}
pt: Parâmetros '{}' e '{}' devem ser informados para a tarefa {}

source: Parameter '{}', '{}' and '{}' must be informed for task {}
pt: Parâmetros '{}', '{}' e '{}' devem ser informados para a tarefa {}

source: Parameter {} and {} must be informed if is using replace by value in task {}.
pt: Parâmetros '{}' e '{}' devem ser informados se usando substituição por valor na tarefa {}

source: Parameter 'value' must be [x>=0] if is using the current type of sampling in task {}.
pt: Parâmetro 'value/valor' deve ser [x>=0] se para o tipo amostra na tarefa {}.

source: Parameter must be informed for task {}.
pt: Parâmetro deve ser informado para a tarefa: {}.

source: Function {f}() does not exists.
pt: Função {f}() não existe.

source: Parameters {}, {} and {} must be informed for task {}.
pt: Parâmetros '{}', '{}' e '{}' devem ser informados para a tarefa {}.

source: Parameters {}, {} and {} must contain only one field (in each one) for task {}.
pt: Parâmetros '{}', '{}' e '{}' devem conter apenas um campo (em cada um) para a tarefa {}.

source: Parameter {} and {} must be informed for task {}
pt: Parâmetro {} e {} precisam ser informados para a tarefa {}

source: Invalid type for operation Tokenizer: {}
pt: Tipo inválido para operação Tokenizer: {}

source: Task completed
pt: Tarefa completada

source: Task running
pt: Tarefa executando

source: Lemonade task %s completed
pt: Tarefa Lemonade %s completada

source: Parents completed, submitting %s
pt: Tarefas pais completadas, submetendo %s

source: Lemonade task %s started
pt: Tarefa Lemonade %s iniciada

source: Submitting parent task {} before {}
pt: Submetendo tarefas-pai {} antes de {}

source: Server is not correctly configured.
pt: Servidor não está corretamente configurado.

source: Generating code for workflow %s, notebook=%s, plain=%s
pt: Gerando código para workflow %s, notebook=%s, plain=%s

source: Success.
pt: Sucesso.

source: Port output format not supported.
pt: Formato da porta de saída não suportado.

source: Success getting data from task.
pt: Sucesso ao obter dados da tarefa.

source: State does not exists, processing app.
pt: Estado não existe, processando a aplicação

source: Invalid port.
pt: Porta inválida.

source: Unable to retrieve data because a previous error.
pt: Não é possível recuperar os dados devido a um erro anterior.

source: Invalid Python code or incorrect encoding: {}
pt: Código Python inválido ou codificação incorreta: {}

source: Job {} was canceled
pt: Trabalho {} foi cancelado.

source: App {} was terminated
pt: Aplicação {} foi finalizada.

source: Workflow specification is missing
pt: Especificação do workflow não especificada

source: Task ignored (not used by other task or as an output)
pt: Tarefa ignorada (não é usada por outra tarefa ou como saída)

source: Finishing minion
pt: Terminar o minion

source: Pressed CTRL+C / SIGINT. Minion canceled the job.
pt: CTRL+C/SIGINT pressionado. Minion cancelou o job.

source: Invalid message JSON: {}
pt: Mensagem JSON inválida: {}

source: Unsupported cluster type, it cannot run Spark applications.
pt: Tipo de cluster não suportado, ele não pode executar aplicações Spark.

source: Cluster configuration changed. Stopping previous cluster.
pt: Configuração do cluster alterada. Parando o cluster anterior.

source: Error in general cluster parameters: {}
pt: Erro nos parâmetros gerais do cluster: {}.

source: Running job, but it requires allocation of cluster computers first and it takes time.
pt: Executando o job, mas ele requer alocação dos computadores no cluster e isto leva tempo.

source: Minion is configured to stop Spark after each execution
pt: Minion está configurado para parar o Spark após cada execução

source: Incorrect cluster config (missing general_parameters).
pt: Configuração incorreta do cluster (falta campo general_parameters).attribute

source: Parameter {} is required
pt: Parâmetro {} é obrigatório

source: Parameter {} is required.
pt: Parâmetro {} é obrigatório

source: Parameter {} {} {} are required.
pt: Parâmetros {} {} {} são obrigatórios.

source: Parameter {} is invalid.
pt: Parâmetro {} é inválido.

source: Parameter {} are required.
pt: Parâmetro {} é obrigatório

source: Parameters {l1} and {l2} are required.
pt: Parâmetros {l1} e {l2} são obrigatórios.

source: Parameters {l1} and {l2} are invalid.
pt: Parâmetros {l1} e {l2} são inválidos.

source: Parameter {} is required. The format is: (x, y) or (-1, x, y)
pt: Parâmetro {} é obrigatório. O formato é: (x, y) ou (-1, x, y)

source: Unsupported file format: {}
pt: Formato de arquivo não suportado: {}

source: Incorrect data source configuration (empty url)
pt: Configuração incorreta para fonte de dados (url vazia)

source: Unsupported image format: {}
pt: Formato de imagem não suportado: {}

source: Training and validation images files are in different formats.
pt: Arquivos de imagem de treinamento e validação estão em formatos diferentes.

source: Unsupported format: {}
pt: Formato não suportado: {}

source: Training and validation files are in different formats.
pt: Arquivos de treino e validação estão em formatos diferentes.

source: Training and test files are in different formats.
pt: Arquivos de treino e teste estão em formatos diferentes.

source: Unsupported cluster type, it cannot run Keras applications.
pt: Tipo de cluster não é suportado, ele não pode executar aplicações Keras.

source: Minion is configured to stop cluster after each execution
pt: Minion está configurado para parar o cluster após cada execução

source: Parameter {} requires at least 2.
pt: Parâmetro {} requer pelo menos 2.

source: Parameter {} is invalid
pt: Parâmetro {} é inválido

source: You need to correctly specify the testing data and the model.
pt: Você precisa especificar corretamente os dados de teste e o modelo.

source: The operation needs training and model.
pt: A operação precisa de treino e modelo.

source: It is not possible to use only validation data.
pt: Não é possível usar apenas dados de validação.

source: It is necessary to inform the model.
pt: É necessário informar um modelo.

source: File {} exists.
pt: Arquivo {} existe.

source: Parameter {} invalid.
pt: Parâmetro {} é inválido.

source: Parameter {} not supported yet.
pt: Parâmetro {} ainda não é suportado.

source: It is necessary to inform {} or {}.
pt: É necessário informar {} ou {}.

source: Unsupported model format: {}
pt: Formato de modelo não suportado: {}

source: Unsupported weights format: {}
pt: Formato de pesos não suportado: {}

source: You must connect a model to load the weights.
pt: Você deve conectar um modelo para carregar os pesos.

source: The operation needs the inputs.
pt: A operação requer entradas.

source: It is necessary to inform the input(s) layer(s).
pt: É necessário informar a(s) camada(s) de entrada.

source: It is necessary to inform the output(s) layer(s).
pt: É necessário informar a(s) camada(s) de saída.

source: It's necessary inform the subset parameter.
pt: É necessário informar o parâmetro subset.

source: Unsupported subset type.
pt: Tipo de subset não suportado.

source: Unsupported storage type: {}
pt: Armazenamento não suportado: {}

source: Parameter {} needs to be positive float
pt: Parâmetro {} deve ser um número positivo

source: At least one input data source is not in the correct format.
pt: Pelo menos uma fonte de dados de entrada não está no formato correto.

source: Internal error.
pt: Erro interno.

source: Invalid encryption function {}
pt: Função de criptografia inválida {}

source: Invalid masking type: {}
pt: Tipo de máscara inválido: {}

source: Data type is not supported for masking: {}
pt: Tipo de dados não suportado para máscara: {}

source: Starting minion
pt: Iniciando o minion

source: (c) Lemonade - DCC UFMG
pt: Direitos Autorais (C) - DCC UFMG

source: {type} is not supported (yet!)
pt: {type} não é suportado (ainda!)

source: Error running minion
pt: Erro executando o minion

source: Reloading {}
pt: Recarregando

source: Task completed, but not executed (not used in the workflow).
pt: Tarefa completada, mas não executada (não foi usada no workflow).

source: Error accessing data. Probably attribute "{}" does not exist.
pt: Erro lendo os dados. Provavelmente, o atributo "{}" não existe.

source: Task running (cached data)
pt: Tarefa executando (usando dados em cache)

source: Starting master process. Reading "start" queue
pt: Inicializando o processo mestre. Lendo a fila de inicialização

source: Reading "start" queue.
pt: Lendo fila "start".

source: Forwarding message to minion.
pt: Encaminhando mensagem para minion.

source: Minion status for (workflow_id=%s,app_id=%s): %s
pt: Estado do Minion para (workflow_id=%s, app_id=%s): %s

source: Minion (workflow_id=%s,app_id=%s) is running on %s.
pt: Minion (workflow_id=%s,app_id=%s) está executando em %s.

source: Message %s forwarded to minion (workflow_id=%s,app_id=%s)
pt: Mesangem %s encaminhada para o minion (workflow_id=%s, app_id=%s)

source: Minion command: %s
pt: Comando do minion: %s

source: Forking minion %s.
pt: Dividingo minion %s.

source: Terminating (workflow_id=%s,app_id=%s)
pt: Terminando (workflow_id=%s, app_id=%s)

source: Unable to launch minion: there is not available port for libprocess.
pt: Impossível iniciar o minion: não há porta disponível para o libprocess.

source: Watching minions events.
pt: Acompanhando eventos do minion.

source: Minion {} finished.
pt: Minion {} terminou.

source: There are messages to process in app {} queue, starting minion.
pt: Existem mensagens a processar na fila da aplicação {}, iniciando o minion.

source: Minion {} joined (pid: {}, port: {}).
pt: Minion juntou-se ao servidor (pid: {}, porta: {}).

source: Juicer server started (pid=%s)
pt: Servidor Juicer iniciado (pid=%s)

source: Terminating %s active minions
pt: Terminando %s minions ativos

source: Killing juicer server subprocesses and terminating
pt: Matando subprocessos do servidor juicer e finalizando

source: Model is being used, but at least one input is missing
pt: Model está sendo usado, mas falta pelo menos uma entrada.

source: Clustering result
pt: Resultado do agrupamento

source: Summary
pt: Sumário

source: Metrics
pt: Métricas

source: Parameter '{}' must be x>0 for task {}
pt: Parâmetro '{}' deve ser x> 0 para tarefa {}

source: Parameter '{}' must be x>=0 for task {}
pt: Parâmetro '{}' deve ser x>= 0 para tarefa {}

source: Number of features
pt: Número de atributos

source: Number of classes
pt: Número de classes

source: Intercept
pt: Interseção

source: Parameter '{}' must be a tuple with the size of each layer for task {}
pt: Parâmetro '{}' deve ser uma tupla com o tamanho de cada camada para a tarefa {}

source: Weights
pt: Pesos

source: Compute cost
pt: Custo computacional

source: Regression only support numerical features.
pt: Regressão suporta apenas features numéricas.

source: Features are not assembled as a vector. They will be implicitly assembled and rows with null values will be discarded. If this is undesirable, explicitly add a feature assembler in the workflow.
pt: Features não estão na forma de um vetor. Elas serão implicitamente agrupadas em um vetor e os registros com valores nulos serão descartados. Se este comportamento não é desejável, adicione explicitamente um montador de features ao fluxo.

source: Silhouette (Euclidean distance)
pt: Silhouette (distância euclidiana)

source: Silhouette (Cosine distance)
pt: Silhouette (distância de cosseno)

source: Cluster centers
pt: Centros dos agrupamentos

source: You must inform all input ports for this operation
pt: Você deve informar todas as portas de entrada para esta operação

source: Not supported
pt: Não suportado

source: Database {} not supported
pt: Base de dados {} não é suportada

source: No command nor table specified for data source.
pt: Nenhum comando ou tabela especificada como fonte de dados.

source: Storage type not supported: {}
pt: Tipo de armazenamento não suportado: {}

source: Data source generated by workflow {}
pt: Fonte de dados gerada pelo workflow {}

source: File already exists
pt: Arquivo já existe

source: File not written (already exists)
pt: Arquivo não foi escrito (já existe)

source: Invalid mode {}
pt: Modo inválido: {}

source: Parameter '{}' must be 0<=x<=1 for task {}
pt: Parâmetro '{}' deve ser 0<=x<=1 for tarefa {}

source: Parameter '{}' must be not None when mode is '{}' for task {}
pt: Parâmetro '{}' não pode ser None quando o modo é '{}' para a tarefa {}

source: Required parameter {} must be informed for task {}
pt: Parâmetro obrigatório {} deve ser informado para tarefa {}

source: Invalid query. Only SELECT is allowed.
pt: Consulta inválida. Apenas SELECT é permitido.

source: Invalid names. Number of attributes in result differs from names informed.
pt: Nomes inválidos. O número de atributos no resultado diferente dos nomes informados.

source: Parameter 'fraction' must be 0<=x<=1 if is using the current type of sampling in task {}.
pt: Parâmetro 'fraction' deve ser 0<=x<=1 se você está usando esse tipo de amosta na tarefa {}.

source: Missing parameters. Check if values for parameters {} were informed
pt: Parâmetros ausentes. Verifique se os valores para os parâmetros {} foram informados

source: Invalid value for parameter {param}: {value}
pt: Valor inválido para o parâmetro {param}: {value}

source: You cannot mix models with and without evaluation (e.g. indexers) when saving models and criteria is different from ALL
pt: Você não pode misturar modelos com e sem avaliação (por exemplo, indexadores) ao salvar modelos e sendo o critério diferente de ALL

source: You cannot mix models built using with different metrics ({}).
pt: Você não pode misturar modelos construídos usando métricas diferentes ({}).

source: Prediction versus Residual
pt: Predição versus Resíduo

source: Residual
pt: Resíduo

source: Prediction
pt: Predição

source: Parameters for this estimator
pt: Parâmetros para o estimador

source: Parameters
pt: Parâmetros

source: Value
pt: Valor

source: Actual versus Prediction
pt: Real versus Predito

source: Actual
pt: Real

source: Metric
pt: Métrica

source: Evaluation result
pt: Resultado da avaliação

source: Invalid metric value {}
pt: Valor de métrica inválido {}

source: Parameter '{}' must be x>1.0 for task {}
pt: Parâmetro '{}' deve ser x>1.0 para tarefa {}

source: Scale
pt: Escala

source: Invalid type '{}' for task {}
pt: Tipo inválido '{}' para a tarefa {}

source: Incorrect data source configuration (empty url or not GEOJSON)
pt: Configuração de fonte de dados incorreta (URL vazia ou não é GEOJSON)

source: Should be implemented in derived classes
pt: Deve estar implementado em classes derivadas

source: X-axis attribute not specified
pt: Atributo do Eixo-X não especificado

source: Attribute {} for X-axis does not exist in ({})
pt: Atributo {} para o eixo-X não existe em ({})

source: At least one attribute for Y-axis does not exist: {}
pt: Pelo menos um atributo para o eixo-Y não existe: {}

source: The maximum number of values for x-axis is 100.
pt: O número máximo de valores para o eixo-x é 100.

source: Attribute {} does not exist in ({})
pt: Atributo {} não existe em ({})

source: Attribute {} for label does not exist in ({})
pt: Atributo {} para o label não existe em ({})

source: The maximum number of values for this chart is 100.
pt: O número máximo para valores para este gráfico é 100.

source: attribute
pt: atributo

source: count
pt: contagem

source: approx. distinct
pt: distintos (aproximado)

source: missing
pt: ausentes

source: min
pt: mínimo

source: max
pt: máximo

source: avg
pt: média

source: std. dev.
pt: desvio padrão

source: skewness
pt: assimetria (skewness)

source: kurtosis
pt: curtose (kurtosis)

source: correlation to {} (Pearson)
pt: correlação com {} (Pearson)

source: Querying Caipirinha URL: %s
pt: Consultando a URL Caipirinha: %s

source: Error in URL {}: HTTP {} - {} ({})
pt: Erro na URL {}: HTTP {} - {} ({})

source: Saving visualizations
pt: Salvando visualizações

source: Result generated
pt: Resultado gerado

source: Visualizations saved
pt: Visualização salva

source: Error querying Limonero URL: %s (%s: %s)
pt: Erro ao consultar URL do Limonero: %s (%s: %s)

source: not found
pt: não encontrado

source: Error loading {} id {}: HTTP {} - {} ({})
pt: Erro carregando {} id {}: HTTP {} - {} ({})

source: Data source not found
pt: Base de dados não encontrada

source: Model not found
pt: Modelo não foi encontrado

source: Error saving model in Limonero URL: %s (%s: %s)
pt: Erro salvando modelo no Limonero URL %s (%s: %s)

source: Error saving model: {})
pt: Erro salvando model: {}

source: Error saving data source in Limonero URL: %s (%s: %s)
pt: Erro salvando fonte de dados no Limonero URL: %s (%s: %s)

source: Error saving datasource: {})
pt: Erro ao salvar a fonte de dados: {}

source: Querying Tahiti URL: %s
pt: Consultando a URL do Tahiti: %s

source: Error loading data from tahiti: id {}: HTTP {} - {} ({})
pt: Erro carregando dados a partir do tahiti: id {}: HTTP {} - {} ({})

source: Akaike's "An Information Criterion" (AIC)
pt: "Um Critério de Informação" (AIC) de Akaike

source: Coefficient standard errors
pt: Coeficientes de erro padrão

source: Degrees of freedom
pt: Graus de Liberdade

source: Depth
pt: Profundidade (altura)

source: Deviance residuals
pt: Desvio dos Residuos

source: Deviance
pt: Desvio

source: Dispersion
pt: Dispersão

source: Explained variance
pt: Variância Explicada

source: Features attribute
pt: Coluna(s) de atributos

source: Feature importances
pt: Importância dos atributos

source: Number of trees
pt: Número de arvores

source: Label attribute
pt: Coluna do rótulo

source: Mean absolute error
pt: Erro Absoluto Médio

source: Mean squared error
pt: Erro Quadrático Médio

source: Deviance for the null model
pt: Desvio para o modelo nulo

source: Number of nodes
pt: Número de nós

source: Number of instances
pt: Número de Instância

source: Iterations
pt: Iterações

source: Objective history
pt: Histórico do Objetivo

source: P-values
pt: Valores p (p-values)

source: Prediction attribute
pt: Coluna de Predição

source: Predictions
pt: Predições

source: R²
pt: Coeficiente de determinação (R²)

source: Adjusted R²
pt: Coeficiente de Determinação Ajustado" (Adjusted R²)

source: Rank
pt: Classificação (rank)

source: Residuals
pt: Residuos

source: Residual degree of freedom
pt: Grau residual de liberdade

source: Residual degree of freedom for the null model
pt: Grau residual de liberdade para o modelo nulo

source: Root mean squared error
pt: Raiz do Erro Quadrático Médio

source: Solver
pt: Solucionador

source: Trees
pt: Árvores

source: T-values
pt: Estatística-t (t-value)

source: Total of iterations
pt: Total de Iterações

source: Filter "{}" is required and its value was not informed.
pt: Filtro "{}" é obrigatório e seu valor não foi informado.

source: Inconsistency in workflow: filter has no name
pt: Inconsistência no fluxo de trabalho: um filtro não tem nome

source: Metadata do not include attributes information
pt: Metadata não incluem informações sobre os atributos

source: Cluster is not configured for Hive Warehouse
pt: Cluster não está configurado com o suporte ao Hive Warehouse Connector

source: Invalid anonymization type ({})
pt: Tipo de anonimização inválido ({})

source: You must specify a name for new data source.
pt: Você deve especificar um nome para a nova base de dados

source: You must specify a valid format.
pt: Você deve especificar um formato válido.

source: You must specify a storage for saving data.
pt: Você deve especificar um local de armazenamento para salvar os dados.

source: You must specify a path for saving data.
pt: Você deve especificar um caminho para salvar os dados.

source: Invalid value '{}' for parameter '{}'
pt: Valor '{}' inválido para parâmetro '{}'

source: Algorithm '{}' not supported in for task {}
pt: Algoritmo '{}' não suportado para a tarefa {}

source: Support must be informed for classifier {}
pt: Suporte deve ser informado para o classificador {}

source: Items in a transaction must be unique
pt: Itens em uma transação devem ser únicos

source: Model trained
pt: Modelo treinado

source: Required Lemonade Spark Extensions not found in CLASSPATH.
pt: Extensões do Lemonade para Spark não foram encontradas no CLASSPATH.

source: Parameter '{}' must be in range [0, 100] for task {}
pt: Parâmetro '{}' deve estar entre [0,100] para a tarefa {}

source: For intersection operation, both input data sources must have the same number of attributes and types.
pt: Para a operação de interseção, ambas as fontes de dados devem ter o mesmo número de atributos e tipos correspondentes.

source: Parameters '{}' and {} must be informed for task {}
pt: Parâmetro '{}' e {} devem ser informado para a tarefa {}

source: You must inform 2 values for alias
pt: Você deve informar 2 valores para o alias

source: No attribute was selected
pt: Nenhum atributo selecionado

source: Parameter '{}' for task '{}' must be a number or enclosed in quotes.
pt: Parâmetro '{}' para a tarefa '{}' deve ser numérico ou estar entre aspas.

source: Value and replacement must be of the same type for all attributes
pt: O valor a ser substituído e a substituição devem ser do mesmo tipo para todos os atributos

source: Missing parameter in aggregation function
pt: Parâmetro ausente na função de agregação

source: Parameter '{}' has an incorrect value '{}' in {}
pt: Parâmetro '{}' tem um valor incorreto '{}' in {}

source: Required parameters must be informed for task {}
pt: Parâmetro necessário deve ser informado para a tarefa {}
