Repository: eubr-bigsea/juicer
Catalog: juicer/i18n/locales/*/LC_MESSAGES/messages.po
Languages: pt

source: Invalid name: {}. Many Python commands are not available in Lemonade
pt: Nome inválido: {}. Vários comandos Python não estão disponíveis no Lemonade por questão de segurança.

source: The value for parameter {} must be one of these: {}.
pt: O valor para o parâmetro {} deve ser um destes: {}.

source: Parameter '{}' must be informed in all expressions in task {}.
pt: Parâmetro '{}' deve ser informado em todas as expressões na tarefa {}.

source: Start of offset must be >= its end: [{}, {}]
pt: O começo do deslocamento deve ser >= ao seu final: [{}, {}]

source: Parameter '{}' informed for task '{}' must be at >= 2
pt: Parâmetro '{}' informado para tarefa '{}' deve ser pelo menos >= 2

source: Parameter '{}' must be informed for task {}
pt: Parâmetro '{}' deve ser informado para tarefa {}

source: Summary for K-fold
pt: Sumário para K-partições (folds)

source: Transformation has an invalid expression. Maybe variables are using spaces in their names.
pt: Transformação possui uma expressão inválida. Talvez os nomes das variáveis contenham espaço.

source: Unknown type: {}
pt: Tipo desconhecido: {}

source: Invalid parameters for function: {}()
pt: Parâmetro inválido para a função: {}()

source: Function set() expects exactly 1 argument.
pt: Função set() espera exatamente 1 argumento.

source: Must be implemented in children classes
pt: Deve ser implementado nas classes descendentes

source: Metrics for task
pt: Métricas para a tarefa

source: Parameter {} must be one of these: {}
pt: Parâmetro {} deve ser um destes: {}

source: type
pt: tipo

source: keep
pt: manter

source: skip
pt: ignorar

source: error
pt: erro

source: Invalid value for {}: "{}".
pt: Valor inválido para {}: "{}"

source: splits
pt: divisões

source: You must inform at least {} values for parameter {}.
pt: Você deve informar pelo menos {} valores para o parâmetro {}.

source: Values for {} must be sorted in ascending order.
pt: Valores para {} devem ser estar ordenados de forma ascendente.

source: Invalid value for {}: {}
pt: Valor inválido para {}: {}

source: Invalid zipped shapefile. It must contains both *.shp and *.dbf files.
pt: Arquivo compactado para shape file inválido. Ele deve conter arquivos *.shp e *.dbf.

source: Values for latitude and longitude columns must be informed
pt: Valores para as colunas latitude e longitude devem ser informados

source: Model is being saved twice (unsupported).
pt: Modelo está sendo salvo duas vezes (não suportado).

source: If a workflow generates a model, it must save such model in order to be deployed
pt: Se um fluxo gera um modelo, o modelo deve ser salvo para que possa ser implantado

source: No training data was informed for model building.
pt: Nenhum treino foi informado para construir o modelo.

source: Parameter '{}' must be in range [x>=0] for task {}
pt: Parâmetro '{}' deve estar na faixa [x>=0] para tarefa {}

source: Parameters '{}', '{}' and '{}' must be informed for task {}
pt: Parâmetro '{}' , '{}' e '{}' devem ser informado para a tarefa {}

source: F1 measure
pt: Medida F (F1)

source: Weighted precision
pt: Precisão ponderada

source: Weighted recall
pt: Revocação ponderada

source: Accuracy
pt: Acurácia

source: Label attribute is categorical, it will be implicitly indexed as string.
pt: Atributo usado como rótulo é categórico e portanto será implicitamente indexado.

source: Metric ({}) average for {} folds: {}
pt: Média da métrica ({}) para {} folds: {}

source: Generated classification model parameters
pt: Parâmetros gerados para o modelo de classificação

source: Parameter
pt: Parâmetro

source: Fold
pt: Fold (partição)

source: Results
pt: Resultados

source: Average
pt: Média

source: Parameter output must be informed for classifier {}
pt: Parâmetro de saída deve ser informado para o classificador {}

source: Models used in ensemble classification
pt: Modelos usados na classificação por comitê

source: name
pt: nome

source: order
pt: ordem

source: weight
pt: peso

source: Invalid optimizer value {} for class {}
pt: Valor de optimizer inválido {} para classe {}

source: Invalid document concentration: {}. It must be a single decimal value or a list of decimal numbers separated by comma.
pt: Parâmetro "concentração de documentos" inválido: {}. Ele deve ser um único valor decimal ou uma lista de valores decimais separados por vírgula.

source: Invalid type {} for class {}
pt: Tipo inválido {} para a classe {}

source: Assemble features in a vector before using a regression model
pt: Monte um vetor de features antes de usar um modelo de regressão

source: Coefficients
pt: Coeficientes

source: Invalid type '{}' for class {}
pt: Tipo inválido '{}' para classe {}

source: Confusion matrix
pt: Matriz de confusão

source: Label
pt: Rótulo

source: Predicted
pt: Predição

source: Area under curve
pt: Área sob a curva

source: False positive rate
pt: Taxa de falsos positivos

source: True positive rate
pt: Taxa de positivos verdadeiros

source: Precision
pt: Precisão

source: Recall
pt: Revocação

source: Tree
pt: Árvore

source: SPARK_HOME set to %s
pt: SPARK_HOME definido como %s

source: SPARK_HOME environment variable is not defined
pt: Variável de ambiente SPARK_HOME não está definida

source: SPARK_DIST_CLASSPATH environment variable is not defined, minion will not run correctly.
pt: Variável de ambiente SPARK_DIST_CLASSPATH não está definida. O minion pode não executar corretamente.

source: Creating a new Spark session
pt: Criando um nova sessão Spark

source: Enabling HIVE Support
pt: Habilitando suporte ao Hive

source: Enabling HIVE Warehouse Support
pt: Habilitando suporte ao HIVE Warehouse

source: Setting spark configuration %s
pt: Ajustando as configurações do spark %s

source: Minion is using '%s' as Spark master
pt: Minion está usando '%s" como mestre Spark

source: value
pt: valor

source: timeline
pt: linha temporal

source: Equal Parity
pt: Paridade equalitária

source: Proportional Parity
pt: Paridade proporcional

source: False-Positive Parity Rate
pt: Taxa de paridade para falso-positivo

source: False-Discovery Parity Rate
pt: Taxa de paridade para falsa-descoberta

source: False-Negative Parity Rate
pt: Taxa de paridade para falso-negativo

source: False-Omission Parity Rate
pt: Taxa de paridade para falsa-omissão

source: Bias/Fairness Report
pt: Relatório de viés/justiça

source: click to open
pt: click para abrir

source: Group
pt: Grupo

source: Acceptable
pt: Aceitável

source: Input attribute(s) must be informed for box plot.
pt: Atributo(s) de entrada deve(m) ser informado(s) para o box plot.

source: Input attribute(s) must be informed for histogram.
pt: O atributo de entrada deve ser informado para o histograma.

source: Attribute {} must be numeric (actual: {}).
pt: Atributo {} deve ser numérico (atual: {}).

source: Attribute {} not found in input data.
pt: Atributo {} não encontrado nos dados de entrada.

source: Histogram
pt: Histograma

source: Parameter delta must be informed if display delta option is enabled.
pt: Parâmetro delta deve ser informado se a opção exibir delta está habilitado.

source: Parameter value must be informed if display value option is enabled.
pt: Parâmetro "valor" deve ser informado se a opção "exibir valor" está habilitada.

source: Features are not assembled as a vector. They will be implicitly assembled and rows with null values will be discarded. If this is undesirable, explicitly add a attribute vectorizer, handle missing data and categorical attributes in the workflow.
pt: Features não estão na forma de um vetor. Elas serão implicitamente agrupadas em um vetor e os registros com valores nulos serão descartados. Se este comportamento não é desejável, adicione explicitamente uma tarefa vetorizar atributos, trate os dados ausentes e atributos categóricos no fluxo.

source: Invalid input data for visualization. It should contains 2 (name, value) or 3 columns (id, name, value).
pt: Entrada de dados invalida para a visualização. Deve conter 2 (nome, valor) ou 3 colunas (id, nome, valor).

source: Attribute
pt: Atributo

source: Type
pt: Tipo

source: Metadata (Spark)
pt: Metadados (Spark)

source: Schema for {}
pt: Schema para {}

source: Sample data for {}
pt: Amostra de dados para {}

source: Attribute {} not found. Valid attributes: {}
pt: Atributo {} não encontrado. Atributos válidos: {}

source: When using Window Operation with range type, the order by attribute must be numeric.
pt: Quando usando operações de janela com tipo "faixa", o atributo de ordenação deve ser numérico.

source: When using Window Operation with range type, the order option must include only one attribute.
pt: Quando usando operações de janela com tipo "faixa", a opção de ordenação deve incluir apenas um atributo.

source: Data source does not exist. It may have been deleted.
pt: Fonte de dados não existe. Ela deve ter sido excluída.

source: Table or view not found: {}
pt: Tabela ou vista/visão não encontrada: {}

source: Attribute {} not found.
pt: Atributo {} não encontrado.

source: Attribute {attr} must be one of these types [{correct}], but it is {used}
pt: Atributo {attr} deve ser de um destes tipo: [{correct}. mas ele é do do tipo {used}

source: Binomial family only supports 1 or 2 outcome classes but found {}
pt: Família binomial suporta apenas 1 ou 2 classes resultantes, mas foram encontradas {}

source: Invalid numeric data in at least one data source (value: {})
pt: Dados numéricos inválidos em pelo menos uma das fontes de dados (valor: {})

source: There is null values in your data set and Spark cannot handle them. Please, remove them before applying a data transformation.
pt: Existem valores nulos no conjunto de dados e o Spark não consegue tratá-los. Por favor, remova-os antes de aplicar a transformação.

source: Cannot read data from the data source. In this case, it may be a configuration problem with HDFS. Please, check if HDFS namenode is up and you correctly configured the option dfs.client.use.datanode.hostname in Juicer' config.
pt: Não foi possível ler dados da fonte de dados. Neste caso, pode ser um problema com a configuração do HDFS. Por favor, verifique se o servidor namenode do HDFS está executando e se você configurou corretamente a opção dfs.client.use.datanode.hostname na configuração do Juicer.

source: You do not have permissions to read or write in the storage. Probably, it is a configuration problem. Please, contact the support.
pt: Você não tem permissões para ler ou escrever no armazenamento. Provavelmente trata-se de um problema de configuração. Por favor, contacte o suporte.

source: GBT classifier requires labels to be in [0, 1] range.
pt: Classificador GBT requer que rótulos estejam na faixa in [0, 1].

source: File already exists. Try to use options to overwrite it.
pt: Arquivo já existe. Tente usar as opções para sobrescrevê-lo.

source: CSV format does not support the data type {}. Try to convert the attribute to string (see to_json()) before saving.
pt: O formato CSV não suporta o tipo de dados {}. Tente converter o atributo para texto (veja to_json()) antes de salvá-lo.

source: File does not exist in HAR: {}
pt: Arquivo não existe no HAR: {}

source: Key error parsing template for instance {instance} {id}. Probably there is a problem with port specification
pt: Erro de chave ao passar o template para a instância {instance} {id}. Provavelmente existe um problema com a especificação de porta

source: Type error in template
pt: Erro de tipo no template

source: Type error parsing template for instance {id} {instance}.
pt: Erro de tipo analisando modelo (template) para instância {id} {instance}

source: Parameter task name is invalid.
pt: O nome da tarefa é inválido.

source: Port '{}/{}' must be informed for operation{}
pt: Porta '{}/{}' deve ser informado para operação {}

source: Task names must be unique.
pt: Nomes de tarefas devem ser únicos (sem repetição)

source: Task {task} uses an invalid or disabled operation ({op})
pt: Tarefa {task} está usando uma operação inválida ou disabilitada ({op})

source: Incorrect configuration for ports: %s, %s
pt: Configuração incorreta para as portas: %s, %s

source: Invalid or non-existing port: '{op}' {s} {t}
pt: Porta inválida ou inexistente: '{op}' {s} {t}

source: Variable "{}" is used in task "{}", but it is undefined.
pt: Variável "{}" é usada na tarefa "{}", mas ela não foi definida.
